app/views/gadmin/gusuario.html.erb


                  <!-- <% cursos = Curso.all.map{|x| [x.nombre.to_s.capitalize] + [x.id.to_s+'_'+x.nombre.to_s]} %>-->
---
SELECT "cursos".* FROM "cursos"