app/controllers/api/v1/asesos_controller.rb

        def index
          asesorias=Asesor.order('created_at DESC');
---
SELECT "asesors".* FROM "asesors" ORDER BY created_at DESC

        def show
          asesorias=Asesor.select("id","fecha","idsec","dia","lugar","horai","cursos.nombre").joins("join seccions on asesors.seccion_id=seccions.id join cursos on seccions.curso_id=cursos.id where seccions.idsec=#{params[:id]}")
---
SELECT "asesors"."id", "asesors"."fecha", idsec, "asesors"."dia", "asesors"."lugar", "asesors"."horai", cursos.nombre FROM "asesors" join seccions on asesors.seccion_id=seccions.id join cursos on seccions.curso_id=cursos.id where seccions.idsec=101