app/controllers/api/v1/citasa_controller.rb

SELECT "citars".* FROM "citars" ORDER BY created_at DESC
---
        def index
          citas=Citar.order('created_at DESC');

SELECT asesors.lugar,citars.fecha as fc,citars.id,cursos.nombre FROM "citars" join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where citars.alumno_id=1
---
        def show
          citas=Citar.select("asesors.lugar,citars.fecha as fc,citars.id,cursos.nombre").joins("join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where citars.alumno_id=#{params[:id]} ")

SELECT  "citars".* FROM "citars" WHERE "citars"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
        def destroy
        citas = Citar.find(params[:id])