app/controllers/api/v1/citasp_controller.rb

        def index
          citas=Citar.order('created_at DESC');
---
SELECT "citars".* FROM "citars" ORDER BY created_at DESC

        def show
          citas=Citar.select("asesors.lugar,citars.fecha as fc,citars.id,cursos.nombre,citars.alumno_id,citars.tema,citars.resumen,citars.reporte").joins("join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where citars.profesorid=#{params[:id]} ")
---
SELECT asesors.lugar,citars.fecha as fc,citars.id,cursos.nombre,citars.alumno_id,citars.tema,citars.resumen,citars.reporte FROM "citars" join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where citars.profesorid=1

        def destroy
        citas = Citar.find(params[:id])
---
SELECT  "citars".* FROM "citars" WHERE "citars"."id" = $1 LIMIT $2  [["id", 133], ["LIMIT", 1]]

        def update
          citas = Citar.find(params[:id])
          if citas.update_attributes(citas_nuevos)
---
SELECT  "citars".* FROM "citars" WHERE "citars"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "citars" SET "reporte" = $1, "updated_at" = $2 WHERE "citars"."id" = $3  [["reporte", "final"], ["updated_at", "2018-11-07 08:46:02.879715"], ["id", 31]]