app/controllers/api/v1/usuarios_controller.rb

        def index
          alumnos=Usuario.select("usuarios.nombre","usuarios.codigo","usuarios.id,nivelu")
---
SELECT usuarios.nombre, usuarios.codigo, usuarios.id,nivelu FROM "usuarios"

        def show
          alumnos=Usuario.select("usuarios.nombre","alumnos.id","usuario_id").joins("join alumnos on alumnos.usuario_id=usuarios.id").where("alumnos.id":params[:id])
---
SELECT usuarios.nombre, profesors.id, usuario_id FROM "usuarios" join profesors on profesors.usuario_id=usuarios.id WHERE "profesors"."id" = $1  [["id", "3"]]

        def create
          alumnos=Usuario.new(alumnos_nuevos)
          if alumnos.save
---
INSERT INTO "usuarios" ("nombre", "codigo", "nivelu", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "Andres"], ["codigo", 209023], ["nivelu", 3], ["created_at", "2018-11-07 07:36:05.647647"], ["updated_at", "2018-11-07 07:36:05.647647"]]

        def update
          alumnos = Usuario.find(params[:id])
          if alumnos.update_attributes(alumnos_nuevos)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "usuarios" SET "nivelu" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["nivelu", 3], ["updated_at", "2018-11-07 08:15:25.607629"], ["id", 1]]