app/controllers/asesoria_g_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 211], ["LIMIT", 1]]
SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."usuario_id" = $1 LIMIT $2  [["usuario_id", 4], ["LIMIT", 1]]
SELECT "carreras"."id", "carreras"."nombre" FROM "carreras"
SELECT "asesors".* FROM "asesors" WHERE (fecha < '2018-11-21 04:51:23.950088')
---
  def alumnosa
    currenU=Usuario.find_by(codigo:session[:usuario])
    alum=Alumno.find_by(usuario_id:currenU.id)
    @idUsuario="Bienvenido #{currenU.codigo}"
  #  @asesoria=Asesor.select("id","dia","lugar","horai","cursos.nombre").joins("join seccions on asesors.seccion_id=seccions.id join cursos on seccions.curso_id=cursos.id ")
    @carrera=Carrera.select("id","nombre")
  #  @cursot=Curso.select("nombre","id")
  #  @Profesor=Usuario.select("usuarios.nombre","profesors.id","usuario_id").joins("join profesors on profesors.usuario_id=usuarios.id").where("nivelu":2)
  for i in Asesor.where("fecha < ?", Time.now)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 211], ["LIMIT", 1]]
SELECT "usuarios".* FROM "usuarios" WHERE ("usuarios"."nombre" != $1)  [["nombre", "Jorge"]]
---
  def chat
      currenU=Usuario.find_by(codigo:session[:usuario])
        alumnosa()
        @user_id=currenU.codigo
        @amigos =Usuario.where.not( nombre:currenU.nombre)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 2555555], ["LIMIT", 1]]
SELECT  "chats".* FROM "chats" WHERE "chats"."origen" = $1 AND "chats"."destino" = $2 LIMIT $3  [["origen", 2555555], ["destino", 211], ["LIMIT", 1]]
INSERT INTO "chats" ("origen", "destino", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["origen", 2555555], ["destino", 211], ["created_at", "2018-11-07 04:58:56.665340"], ["updated_at", "2018-11-07 04:58:56.665340"]]
---
    def comunicar
      currenU=Usuario.find_by(codigo:session[:usuario])
      chat()
      amigo=params["amigo"]
      amigoc=Usuario.find_by(codigo:amigo)


      @mensaje2=amigoc.nombre
      @destino_id=amigoc.codigo



            if  Chat.find_by(origen: currenU.codigo  , destino:amigoc.codigo)==nil and Chat.find_by(origen: amigoc.codigo  , destino:currenU.codigo)==nil
              nuevo=Chat.create(origen: currenU.codigo  , destino:amigoc.codigo)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 20132670], ["LIMIT", 1]]
SELECT  "profesors".* FROM "profesors" WHERE "profesors"."usuario_id" = $1 LIMIT $2  [["usuario_id", 1], ["LIMIT", 1]]
SELECT usuarios.nombre, citars.tema,citars.reporte,citars.fecha,citars.resumen FROM "usuarios" join alumnos on usuarios.id=alumnos.usuario_id join citars on citars.alumno_id=alumnos.id where citars.profesorid=1
---
  def estado_reporte

    currenU=Usuario.find_by(codigo:session[:usuario])
    profe=Profesor.find_by(usuario_id:currenU.id)


    @all=Usuario.select("usuarios.nombre, citars.tema,citars.reporte,citars.fecha,citars.resumen").joins("join alumnos on usuarios.id=alumnos.usuario_id join citars on citars.alumno_id=alumnos.id where citars.profesorid=#{profe.id}")

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 2555555], ["LIMIT", 1]]
SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."usuario_id" = $1 LIMIT $2  [["usuario_id", 2], ["LIMIT", 1]]
SELECT asesors.lugar,citars.fecha as fc,citars.id,cursos.nombre FROM "citars" join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where citars.alumno_id=1
---
  def alumnosb
    alumnosa()
    currenU=Usuario.find_by(codigo:session[:usuario])
    alum=Alumno.find_by(usuario_id:currenU.id)
     @citas=Citar.select("asesors.lugar,citars.fecha as fc,citars.id,cursos.nombre").joins("join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where citars.alumno_id=#{alum.id} ")

SELECT  "citars".* FROM "citars" WHERE "citars"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def vercita
    alumnosb()
    @citamensaje=true
    cita=params["citaselecto"]

    gg=Citar.find_by(id:cita)

SELECT "asesors".* FROM "asesors" WHERE (fecha < '2018-11-21 07:33:12.694397')
---
  def controlasesori
    for i in Asesor.where("fecha < ?", Time.now)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 20132670], ["LIMIT", 1]]
SELECT  "profesors".* FROM "profesors" WHERE "profesors"."usuario_id" = $1 LIMIT $2  [["usuario_id", 1], ["LIMIT", 1]]
SELECT "seccions"."idsec", "seccions"."id", cursos.nombre, "seccions"."capacidad" FROM "seccions" join cursos on cursos.id=seccions.curso_id join profesors on seccions.profesor_id=profesors.id where profesors.usuario_id=1
SELECT COUNT(*) FROM "citars" WHERE "citars"."asesor_id" = $1  [["asesor_id", 7]]
SELECT DISTINCT cursos.nombre,asesors.id,seccions.idsec,count(citars.asesor_id) as d FROM "citars" join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where seccions.profesor_id=1 GROUP BY citars.asesor_id,cursos.nombre,seccions.idsec,asesors.id
---
  def profesoresa


  currenU=Usuario.find_by(codigo:session[:usuario])
  profe=Profesor.find_by(usuario_id:currenU.id)
  @idUsuario="Bienvenido #{currenU.codigo}"
  @todos=Seccion.select("idsec","id","cursos.nombre","capacidad").joins("join cursos on cursos.id=seccions.curso_id join profesors on seccions.profesor_id=profesors.id where profesors.usuario_id=#{currenU.id}")
  @Citasco=Citar.where(asesor_id: 7).count
  @citasxaten= Citar.select("cursos.nombre,asesors.id,seccions.idsec,count(citars.asesor_id) as d").joins("join asesors on citars.asesor_id=asesors.id join seccions on asesors.seccion_id=seccions.id join cursos on cursos.id=seccions.curso_id where seccions.profesor_id=#{profe.id}").group("citars.asesor_id,cursos.nombre,seccions.idsec,asesors.id").distinct

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 20132670], ["LIMIT", 1]]
SELECT  "profesors".* FROM "profesors" WHERE "profesors"."usuario_id" = $1 LIMIT $2  [["usuario_id", 1], ["LIMIT", 1]]
UPDATE "profesors" SET "estado" = $1, "updated_at" = $2 WHERE "profesors"."id" = $3  [["estado", 0], ["updated_at", "2018-11-07 09:28:02.644837"], ["id", 1]]
---
def deshabilitarp
  profesoresa()
  currenU=Usuario.find_by(codigo:session[:usuario])
  profe=Profesor.find_by(usuario_id:currenU.id)
  profe.estado=1
  profe.save

SELECT  "seccions".* FROM "seccions" WHERE "seccions"."idsec" = $1 LIMIT $2  [["idsec", 101], ["LIMIT", 1]]
---
  def cursopselec

    profesoresa()

    @mensaje1 = true
    @mensaje2 = true
    gg=Seccion.find_by(idsec:params["cursoselecto"])

SELECT  "profesors".* FROM "profesors" WHERE "profesors"."usuario_id" = $1 LIMIT $2  [["usuario_id", 1], ["LIMIT", 1]]
---
  def   crearasesoria
    profesoresa()

    gg1=Profesor.find_by(usuario_id:session[:usuario])

SELECT "cursos"."id", "cursos"."nombre" FROM "cursos" join carrxcurs  on  cursos.id=carrxcurs.idcurso where carrxcurs.idcarrera=2
---
def carreraelecta
  alumnosa()
  @asesoria1=true
  ll=params["carrera"]
  @filacarrera=ll
  asesoriasshow(ll)
  @busquedacursos=true
  @cursot=Curso.select("id","nombre").joins(" join carrxcurs  on  cursos.id=carrxcurs.idcurso where carrxcurs.idcarrera=#{ll}")

SELECT "asesors"."id", "asesors"."fecha", idsec, "asesors"."dia", "asesors"."lugar", "asesors"."horai", cursos.nombre FROM "asesors" join seccions on asesors.seccion_id=seccions.id join cursos on seccions.curso_id=cursos.id where seccions.curso_id=1
SELECT "cursos"."id", "cursos"."nombre" FROM "cursos" join carrxcurs  on  cursos.id=carrxcurs.idcurso where carrxcurs.idcarrera=2
SELECT usuarios.nombre, profesors.id, seccions.idsec, usuario_id FROM "usuarios" join profesors on profesors.usuario_id=usuarios.id  join seccions on  seccions.profesor_id=profesors.id WHERE "usuarios"."nivelu" = $1 AND "seccions"."curso_id" = $2  [["nivelu", 2], ["curso_id", "1"]]
---
def cursoselec
  alumnosa()
  @asesoria2=true
  ll=params["cursoelec"]
  gg=params["idcarrera"]
  @filacursosec=ll
  @filacarrera=gg
  @asesoria=Asesor.select("id","fecha","idsec","dia","lugar","ubicacion","horai","cursos.nombre").joins("join seccions on asesors.seccion_id=seccions.id join cursos on seccions.curso_id=cursos.id where seccions.curso_id=#{ll} and asesors.disponibilidada=1")
  @busquedacursos=true
  @cursot=Curso.select("id","nombre").joins(" join carrxcurs  on  cursos.id=carrxcurs.idcurso where carrxcurs.idcarrera=#{gg}")
  @busquedaprofesores=true

  @Profesor=Usuario.select("usuarios.nombre","profesors.id").joins("join profesors on profesors.usuario_id=usuarios.id  join seccions on  seccions.profesor_id=profesors.id    ").where("nivelu":2,"seccions.curso_id":ll).distinct()

SELECT  "asesors".* FROM "asesors" WHERE "asesors"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 2555555], ["LIMIT", 1]]
SELECT  "seccions".* FROM "seccions" WHERE "seccions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "alumnos".* FROM "alumnos" WHERE "alumnos"."usuario_id" = $1 LIMIT $2  [["usuario_id", 2], ["LIMIT", 1]]
INSERT INTO "citars" ("created_at", "updated_at", "asesor_id", "alumno_id", "fecha", "profesorid") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2018-11-07 07:56:14.194772"], ["updated_at", "2018-11-07 07:56:14.194772"], ["asesor_id", 19], ["alumno_id", 1], ["fecha", "2018-10-17"], ["profesorid", 1]]
---
def solicitarase
  alumnosa()
  dd=params["cursoselecto"]
  go=Asesor.find_by(id:dd)
  currenU=Usuario.find_by(codigo:session[:usuario])
  jj=Seccion.find_by(id:go.seccion_id)
  alumno=Alumno.find_by(usuario_id:currenU.id)

  secc=Citar.new(alumno_id:alumno.id,asesor_id:dd,fecha:go.fecha,profesorid:jj.profesor_id)
  secc.save

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "profesors".* FROM "profesors" WHERE "profesors"."usuario_id" = $1 LIMIT $2  [["usuario_id", 1], ["LIMIT", 1]]
---
def profesoresb
  bb=params["asesoria"]
  currenU=Usuario.find_by(codigo:session[:usuario])
  profe=Profesor.find_by(usuario_id:currenU.id)