app/controllers/gadmin_controller.rb

SELECT Nombre FROM "facultads"
SELECT Nombre FROM "carreras"
SELECT Fecha FROM "semestres"
---
  def gusuario
    #@pp=Servicio.select("servicios.origen","servicios.destino","taxist_id","nombre","id").joins("join taxists on taxists.id=servicios.taxist_id").where(estado:1,finalizado:nil)
    @todos=Usuario.select("id","codigo","email","nombre","nivelu","contrasena","activo").where(activo:1)
    @todos2=Usuario.select("id","codigo","email","nombre","nivelu","contrasena","activo").where(activo:nil)
    @Facultad=Facultad.select("Nombre","id")
    @Carrera=Carrera.select("Nombre","id")
    @Semestre=Semestre.select("Fecha","id")

INSERT INTO "carreras" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-11-21 04:37:11.349125"], ["updated_at", "2018-11-21 04:37:11.349125"]]
---
  def crearcarrera
    gusuario()
    car=Carrera.new(nombre:params["crearcarrera"])

    car.save

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cursos" SET "nombre" = $1, "updated_at" = $2 WHERE "cursos"."id" = $3  [["nombre", "nombre nuevo"], ["updated_at", "2018-11-21 06:53:56.393624"], ["id", 1]]
---
  def cambiarnombre
    getc()
    cursoid=params["idc"]
    nombrec=params["nombre"]
    buscaC=Curso.find_by(id:cursoid)
    buscaC.nombre=nombrec
    buscaC.save

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def deshabilitar
    getc()
    cursoid=params["idc"]

    buscaC=Curso.find_by(id:cursoid)

SELECT "cursos"."nombre", "cursos"."id", "cursos"."nivelusuario" FROM "cursos"
---
  def getc
    @Curso=Curso.select("nombre","id","nivelusuario")