app/controllers/gadmin_controller.rb

SELECT "usuarios"."codigo", "usuarios"."email", "usuarios"."nombre", "usuarios"."nivelu" FROM "usuarios"
SELECT "seccions"."id" FROM "seccions"
---
  def gusuario
    #@pp=Servicio.select("servicios.origen","servicios.destino","taxist_id","nombre","id").joins("join taxists on taxists.id=servicios.taxist_id").where(estado:1,finalizado:nil)
    @todos=Usuario.select("codigo","email","nombre","nivelu")
    @Facultad=Facultad.select("Nombre")
    @Carrera=Carrera.select("Nombre")
    @Semestre=Semestre.select("Fecha")
    @Seccion=Seccion.select("id")