app/controllers/login_controller.rb

SELECT "messages".* FROM "messages"
---
  def inicio
    @messages = Message.all