app/controllers/login_controller.rb

SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def inicio
    @messages = Message.last(5)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 AND "usuarios"."contrasena" = $2 LIMIT $3  [["codigo", 20132670], ["contrasena", "gg"], ["LIMIT", 1]]
---
  def verificar
      inicio()
       cod = params[:codigou]
       contrasenia = params[:clave]


         if  Usuario.find_by(codigo: params[:codigou] , contrasena:params[:clave])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."codigo" = $1 LIMIT $2  [["codigo", 20132670], ["LIMIT", 1]]
INSERT INTO "usuarios" ("contrasena", "codigo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["contrasena", "1234"], ["codigo", 20132670], ["created_at", "2018-09-03 05:50:36.194624"], ["updated_at", "2018-09-03 05:50:36.194624"]]
---
  def registrar
    inicio()
    userReg=params[:codigou]
    contrasenia =params[:clave]
    buscarU=Usuario.find_by(codigo:userReg)

      if buscarU==nil
        nuevo=Usuario.create(codigo: params[:codigou] , contrasena:params[:clave])